Revit 2027 API
ParameterUtils.IsBuiltInParameter(ElementId) Method
 Checks whether an ElementId identifies a built-in parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsBuiltInParameter(
	ElementId parameterId
)
Public Shared Function IsBuiltInParameter (
	parameterId As ElementId
) As Boolean
public:
static bool IsBuiltInParameter(
	ElementId^ parameterId
)
static member IsBuiltInParameter :
        parameterId : ElementId -> bool
Parameters
parameterId ElementId
 The identifier to check.
Return Value
Boolean
 True if the ElementId identifies a built-in parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 An ElementId identifies a built-in parameter if it corresponds to a valid BuiltInParameter value.
See Also
Reference
ParameterUtils Class
IsBuiltInParameter Overload
Autodesk.Revit.DB Namespace